# AdditionalPartNotLoaded Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..AdditionalPartNotLoaded Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
An additional part was not loaded.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AdditionalPartNotLoaded { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AdditionalPartNotLoaded As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AdditionalPartNotLoaded {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace